#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Reading...
aws_iam_role.AmazonEKSNodeGroupRole: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole]
aws_vpc.vpc: Refreshing state... [id=vpc-02dac8c253ff756cf]
aws_eip.eip_01: Refreshing state... [id=eipalloc-0ae596521a8c8de1c]
aws_eip.eip_02: Refreshing state... [id=eipalloc-05f83cb34bd504a77]
data.aws_iam_policy_document.AmazonEKSClusterAssumeRolePolicy: Read complete after 0s [id=3552664922]
aws_iam_role.AmazonEKSClusterRole: Refreshing state... [id=earth-dev-AmazonEKSClusterRole]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231214042602247500000004]
aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=earth-dev-AmazonEKSClusterRole-20231214042602204300000003]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231214042602089100000001]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231214042602124500000002]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=earth-dev-AmazonEKSNodeGroupRole-20231214051820789000000001]
aws_internet_gateway.internet_gateway: Refreshing state... [id=igw-0884e48f1d836a01f]
aws_subnet.private_subnet_02: Refreshing state... [id=subnet-006f51b2e2b38aa6b]
aws_security_group.allnodes-sg: Refreshing state... [id=sg-097f7f1c613e1cc68]
aws_subnet.private_subnet_01: Refreshing state... [id=subnet-09e0f8261dd478f20]
aws_subnet.public_subnet_01: Refreshing state... [id=subnet-09a23579b71b210a6]
aws_security_group.cluster_sg: Refreshing state... [id=sg-0497f9160c04b633b]
aws_subnet.public_subnet_02: Refreshing state... [id=subnet-0244eb7821cb0c053]
aws_route_table.public_route_table: Refreshing state... [id=rtb-01aa39a909f5ac25c]
aws_eks_cluster.eks_cluster: Refreshing state... [id=earth-dev]
aws_nat_gateway.nat_gateway_01: Refreshing state... [id=nat-0e83658faadd88cfa]
aws_route_table_association.route_table_association_p01: Refreshing state... [id=rtbassoc-0daf7d05ed0a11975]
aws_route_table_association.route_table_association_p02: Refreshing state... [id=rtbassoc-039c210f4a2014335]
aws_nat_gateway.nat_gateway_02: Refreshing state... [id=nat-08398a57971df9e67]
aws_route_table.private_route_table_01: Refreshing state... [id=rtb-0ba337ded925568b2]
aws_route_table.private_route_table_02: Refreshing state... [id=rtb-089a1b24baf42271b]
aws_eks_identity_provider_config.oidc: Refreshing state... [id=earth-dev:earth-dev]
data.tls_certificate.eks_cluster: Reading...
aws_launch_template.app_node: Refreshing state... [id=lt-06fe44bca43eb8f95]
aws_route_table_association.route_table_association_i01: Refreshing state... [id=rtbassoc-02322ce3ee3019638]
aws_route_table_association.route_table_association_i02: Refreshing state... [id=rtbassoc-07ff63dc040798c07]
aws_eks_node_group.app_node_group: Refreshing state... [id=earth-dev:app-node-group]
data.tls_certificate.eks_cluster: Read complete after 1s [id=d516f34410b983ad338645e4e1cb5bbfcdf5079b]
aws_iam_openid_connect_provider.eks_cluster: Refreshing state... [id=arn:aws:iam::318374019075:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/1BD0061D0E545277BFFD997E08FC9F50]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.AmazonEKSS3CSIDriverPolicy will be created
  + resource "aws_iam_policy" "AmazonEKSS3CSIDriverPolicy" {
      + arn         = (known after apply)
      + description = "earth-dev-AmazonEKSS3CSIDriverPolicy"
      + id          = (known after apply)
      + name        = "earth-dev-AmazonEKSS3CSIDriverPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::eks-share",
                        ]
                      + Sid      = "MountpointFullBucketAccess"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:AbortMultipartUpload",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::eks-share/*",
                        ]
                      + Sid      = "MountpointFullObjectAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
          + "Name"        = "earth-dev"
        }
    }

  # aws_iam_role_policy_attachment.AmazonEKSS3CSIDriverPolicy will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEKSS3CSIDriverPolicy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "earth-dev-AmazonEKSNodeGroupRole"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jonghak-dev, Action: `pull_request`, Workflow: `Terraform apply`*